---
layout: post
title: "JavaScript"
categories: notation
subtitle: JavaScript Wins
---

* testing with code blocks

#+BEGIN_SRC js
let colors = [ "red", "purple", "green" ];
if (x) {
  console.log('cl');
}
let [ firstColor, ...remain ] = colors;
console.log(firstColor);
console.log(remain);
#+END_SRC

#+RESULTS:
: red
: [ 'purple', 'green' ]
: undefined

#+BEGIN_SRC js2
if (x) {
  console.log('zxcv');
}
let colors = [ "red", "purple", "green" ];
let [ firstColor, ...remain ] = colors;
console.log(firstColor);
console.log(remain);
#+END_SRC



* Template Literals

#+BEGIN_SRC js :cmd "org-babel-node"
  function cl(input) {
    console.log(input);
  }

let a = `asdf`;
console.log(a);
#+END_SRC

#+RESULTS:
: asdf
: undefined


** Objects

#+BEGIN_SRC js
console.log('df');
#+END_SRC

#+RESULTS:
: df
: undefined

#+BEGIN_SRC js :cmd "org-babel-node"
let props = {
  postData: {
    title: 'pd-title',
    description: 'pd-desc',
    path: 'pd-path'
  },
  title: 'reg-title',
  description: 'reg-desc',
  path: 'reg-path'
}

const { title, description, path } = props.postData;

console.log(title);
console.log(description);
console.log(path);
#+END_SRC

#+RESULTS:
: pd-title
: pd-desc
: pd-path
: undefined


#+BEGIN_SRC js :cmd "babel-node --presets=stage-2"
let obj1 = {
  bird: "falcon2",
  frog: "bullfrog"
}
let { bird, frog: frogName } = obj1;
console.log(bird);
console.log(frogName);

let obj2 = {
  fruit: "apple",
  veggie: "kale",
  meat: "tofuball"
}
let { fruit, ...restItem } = obj2;
console.log(fruit);
console.log(restItem);
#+END_SRC

#+RESULTS:


* SCRATCH / TEST

#+BEGIN_SRC js :cmd "org-babel-node"
let props = {
  postData: {
    title: 'pd-title',
    description: 'pd-desc',
    path: 'pd-path'
  },
  title: 'reg-title',
  description: 'reg-desc',
  path: 'reg-path'
}
console.log(props);
#+END_SRC

#+RESULTS:
: { postData: { title: 'pd-title', description: 'pd-desc', path: 'pd-path' },
:   title: 'reg-title',
:   description: 'reg-desc',
:   path: 'reg-path' }
: undefined


#+BEGIN_SRC js :cmd "org-babel-node --presets=es2015"
  const animals = ['dog', 'cat']

  animals.map((anim) => {
    console.log('anim', anim);
  })
#+END_SRC

#+RESULTS:
: anim dog
: anim cat
: undefined
